In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2': ['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0  1.797101  0.820360  X  alpha
1  1.352175  0.016564  X   beta
2  0.704916  1.786692  Y  alpha
3 -1.043088  0.251596  Y   beta
4 -1.837953 -0.105237  Z  alpha

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X    1.574638
Y   -0.169086
Z   -1.837953
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    1.352175
    JAN    0.704916
NY  FEB   -1.043088
    JAN   -0.020426
Name: dataset1, dtype: float64

In [9]:
dframe

   dataset1  dataset2 k1     k2
0  1.797101  0.820360  X  alpha
1  1.352175  0.016564  X   beta
2  0.704916  1.786692  Y  alpha
3 -1.043088  0.251596  Y   beta
4 -1.837953 -0.105237  Z  alpha

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   1.574638  0.418462
Y  -0.169086  1.019144
Z  -1.837953 -0.105237

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.797101  0.820360
   beta   1.352175  0.016564
Y  alpha  0.704916  1.786692
   beta  -1.043088  0.251596
Z  alpha -1.837953 -0.105237

In [12]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [13]:
dframe

   dataset1  dataset2 k1     k2
0  1.797101  0.820360  X  alpha
1  1.352175  0.016564  X   beta
2  0.704916  1.786692  Y  alpha
3 -1.043088  0.251596  Y   beta
4 -1.837953 -0.105237  Z  alpha

In [14]:
for name,group in dframe.groupby('k1'):
    print "This is the %s group" %name
    print group
    print '\n'

This is the X group
   dataset1  dataset2 k1     k2
0  1.797101  0.820360  X  alpha
1  1.352175  0.016564  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  0.704916  1.786692  Y  alpha
3 -1.043088  0.251596  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -1.837953 -0.105237  Z  alpha

In [15]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print "key1 = %s key2 %s" %(k1,k2)
    print group
    print '\n'

key1 = X key2 alpha
   dataset1  dataset2 k1     k2
0  1.797101   0.82036  X  alpha


key1 = X key2 beta
   dataset1  dataset2 k1    k2
1  1.352175  0.016564  X  beta


key1 = Y key2 alpha
   dataset1  dataset2 k1     k2
2  0.704916  1.786692  Y  alpha


key1 = Y key2 beta
   dataset1  dataset2 k1    k2
3 -1.043088  0.251596  Y  beta


key1 = Z key2 alpha
   dataset1  dataset2 k1     k2
4 -1.837953 -0.105237  Z  alpha

In [16]:
dframe

   dataset1  dataset2 k1     k2
0  1.797101  0.820360  X  alpha
1  1.352175  0.016564  X   beta
2  0.704916  1.786692  Y  alpha
3 -1.043088  0.251596  Y   beta
4 -1.837953 -0.105237  Z  alpha

In [17]:
group_dict = dict(list(dframe.groupby('k1')))

In [18]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  1.797101  0.820360  X  alpha
1  1.352175  0.016564  X   beta

In [19]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [20]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.797101  0.820360
 1  1.352175  0.016564
 2  0.704916  1.786692
 3 -1.043088  0.251596
 4 -1.837953 -0.105237, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [ ]:
dataset2_group = dframe.groupby(;)